kernel/2014-09-26-mdev-introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Mdev Introduction</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Micky Ching" />
<link rel="stylesheet" href="../theme/default.css" />


</head>
<body>
<div id="content">
<h1 class="title">Mdev Introduction</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本概念</a>
<ul>
<li><a href="#sec-1-1">1.1. 简介</a></li>
<li><a href="#sec-1-2">1.2. 编译配置</a></li>
<li><a href="#sec-1-3">1.3. 初始化脚本</a></li>
<li><a href="#sec-1-4">1.4. 配置文件</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. 路径控制命令</a></li>
<li><a href="#sec-1-4-2">1.4.2. 外部命令</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. 固件</a></li>
<li><a href="#sec-1-6">1.6. 顺序插拔</a></li>
<li><a href="#sec-1-7">1.7. 热插拔配置</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本概念</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 简介</h3>
<div class="outline-text-3" id="text-1-1">
<p>
mdev官方的叫法是mini udev in busybox，mdev实际只是busybox的一个符号链接。
执行mdev -s时会扫描/sys/class和/sys/block中的所有目录，
如果目录中有名为dev的文件，就从中读取设备号，并利用设备号在/dev下面创建节点。
</p>

<p>
启动时需要设置热插拔处理程序为mdev，当有热插拔事件产生时，内核调用mdev。
mdev通过环境变量ACTION和DEVPATH确定热插拔事件和影响目录，
接着查看目录下是否有dev文件，并利用其信息创建/dev节点。
如果ACTION为add，就会创建设备节点，如果为remove则删除设备节点。
</p>

<p>
mdev通过判断路径字符串第6个字符串是否为c来判断是字符设备还是块设备，
如path = "<i>sys/class</i>&#x2026;"第6个字符为c，就被判断为字符设备，
path = "<i>sys/devices</i>&#x2026;"会被判断为块设备。
所以写驱动只应当在/sys/class和/sys/block中创建设备属性文件。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 编译配置</h3>
<div class="outline-text-3" id="text-1-2">
<p>
在busybox配置中加上mdev支持，此外如果要使用自动挂载功能，需要利用额外的脚本，
也就是可能还需要其他常用工具，如grep、mount、sh等。
</p>

<p>
另外在内核配置上面也要添加文件系统支持，包括语言支持，
既然要用到mdev也需要热插拔支持。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 初始化脚本</h3>
<div class="outline-text-3" id="text-1-3">
<p>
mdev有两个用途，一个是初始化扫描，一个是动态更新。
mdev关键需要sysfs的支持，也就是必须要有/sys目录。
在扫描的时候mdev会扫描/sys/class/&#x2026;/dev文件，dev文件是包含设备号的文件，
其所在的目录一般就对应为相关设备的属性目录。
至于动态更新，需要在内核支持热插拔，当发现有插拔事件的时候，内核会发出通知，
并调用hotplug程序，一般PC上是udev，嵌入式平台是mdev，
通过写入如下文件来指定热插拔程序为mdev。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #000000;">echo</span> /bin/mdev &gt; /proc/sys/kernel/hotplug
</pre>
</div>
<p>
内核在调用热插拔处理程序的时候会传递一系列环境变量，在写mdev的配置文件时，
也可以利用这里环境变量。
</p>

<p>
在嵌入式平台，要支持mdev，首先要做的是配置系统启动设置，包括挂载必要的文件系统，
以及设置hotplug程序。
如下是一段典型的初始化脚本。
</p>
<div class="org-src-container">

<pre class="src src-sh">mount -t proc proc /proc                <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#29992;&#20110;&#35774;&#23450;hotplug&#30340;&#25991;&#20214;&#31995;&#32479;</span>
mount -t sysfs sysfs /sys               <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#29992;&#20110;mdev&#25195;&#25551;&#30340;&#25991;&#20214;&#31995;&#32479;</span>
mount -t tmpfs -o <span style="color: #000000;">size</span>=64k,<span style="color: #000000;">mode</span>=0755 tmpfs /media <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#29992;&#20110;&#25346;&#36733;&#30913;&#30424;&#35774;&#22791;</span>
mount -t tmpfs -o <span style="color: #000000;">size</span>=64k,<span style="color: #000000;">mode</span>=0755 tmpfs /dev   <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#29992;&#20110;&#21019;&#24314;&#35774;&#22791;&#33410;&#28857;</span>
<span style="color: #000000;">echo</span> /bin/mdev &gt; /proc/sys/kernel/hotplug         <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#35774;&#23450;hotplug&#31243;&#24207;</span>
mdev -s                                           <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#21551;&#21160;&#25195;&#25551;</span>
</pre>
</div>

<p>
如果文件系统在flash外运行，还需要先创建/dev/pts节点，再执行mdev的初始化脚本。
</p>
<div class="org-src-container">

<pre class="src src-sh">mkdir /dev/pts
mount -t devpts devpts /dev/pts
</pre>
</div>

<p>
也可以不通过procfs来设置hotplug程序，通过如下命令实现。
</p>
<div class="org-src-container">

<pre class="src src-sh">sysctl -w kernel.hotplug=/sbin/mdev
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 配置文件</h3>
<div class="outline-text-3" id="text-1-4">
<p>
配置文件位于/etc/mdev.conf，语法分为四个部分。
第1部分是匹配规则，也就是匹配到对应的设备，
第2部分是用户ID和组ID，第3部分是权限，最后一部分是命令。
</p>

<p>
文件格式如下：
</p>
<div class="org-src-container">

<pre class="src src-sh">[-][envmatch]&lt;device_regex&gt;        &lt;uid&gt;:&lt;gid&gt; &lt;permissions&gt; [cmd]
[-][envmatch]@&lt;maj[,min1[-min2]]&gt;  &lt;uid&gt;:&lt;gid&gt; &lt;permissions&gt; [cmd]
[-][envmatch]$<span style="color: #000000;">envvar</span>=&lt;regex&gt;       &lt;uid&gt;:&lt;gid&gt; &lt;permissions&gt; [cmd]
[-][envmatch]subsystem/regex       &lt;uid&gt;:&lt;gid&gt; &lt;permissions&gt; [cmd]
</pre>
</div>
<dl class="org-dl">
<dt> - </dt><dd>  不要在匹配到该行就停止搜索
</dd>
<dt> uid/gid </dt><dd>  可以是数字也可以是名字
</dd>
</dl>

<p>
其中"$envvar=&lt;regex&gt;"在热插拔设备需要模块载入时非常有用，因为此时没有驱动，
也就不会存在/sys/class/&#x2026;/dev文件，但是$MODALIAS会设置，表示需要的模块。
可以使用如下规则，在需要模块的时候自动导入模块。
</p>
<div class="org-src-container">

<pre class="src src-sh">$<span style="color: #000000;">MODALIAS</span>=.* 0:0 660 @modprobe <span style="color: #ff0000;">"$MODALIAS"</span>
</pre>
</div>
<p>
当/sys/class/&#x2026;/dev出现的时候又会产生另一个热插拔事件给mdev处理。
</p>

<p>
命令分两种，一种是控制设备节点生成路径，一种是执行外部shell命令，
两者可以同时使用。
</p>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 路径控制命令</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
路径控制的命令格式为
</p>
<div class="org-src-container">

<pre class="src src-sh">[=&gt;!]path
</pre>
</div>
<dl class="org-dl">
<dt> = </dt><dd>  仅仅移动路径，如果要移动到一个目录下面，在path后面一定要有一个斜杠"/"。
</dd>
<dt> &gt; </dt><dd>  移动路径，并在dev下面创建一个符号链接
</dd>
<dt> ! </dt><dd>  禁止创建设备节点
</dd>
<dt> %1..%9 </dt><dd>  如果用了正则表达式，那么用该符号引用匹配到的表达式，
一个小括号作为一组，依次用%1..%9表示。
</dd>
</dl>

<p>
简单示例如下。
</p>
<div class="org-src-container">

<pre class="src src-sh">hda 0:0 660 =drives/                    <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#23558;hda&#31227;&#21160;&#21040;drives&#30446;&#24405;</span>
hdb 0:0 660 =cdrom                      <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#23558;hdb&#21629;&#21517;&#20026;cdrom</span>
tty[a-z] 0:0 660 !                      <span style="color: #228b22; font-style: italic;"># </span><span style="color: #228b22; font-style: italic;">&#21033;&#29992;!&#38459;&#27490;&#21019;&#24314;&#35774;&#22791;&#33410;&#28857;</span>
([hs]d[a-z])            root:disk       660 &gt;disk/%1/0
([hs]d[a-z])([0-9]+)    root:disk       660 &gt;disk/%1/%2
<span style="color: #8b008b; font-weight: bold;">mmcblk</span>([0-9]+)          root:disk       660 &gt;disk/mmc/%1/0
<span style="color: #8b008b; font-weight: bold;">mmcblk</span>([0-9]+)p([0-9]+) root:disk       660 &gt;disk/mmc/%1/%2
(tun|tap)               root:network    660 &gt;net/%1
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> 外部命令</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
要执行外部命令，需要在特殊符号后面加上要执行的命令，特殊符号用于指示执行的时间。
命令是通过system系统调用执行的，因此要确保有安装sh。
命令会获取到两个环境变量，$SUBSYSTEM和$MDEV，$SUBSYSTEM表示设备所在的子系统，
$MDEV为设备名字，如hda。
</p>
<div class="org-src-container">

<pre class="src src-sh">[@|$|*]&lt;command&gt;
</pre>
</div>
<dl class="org-dl">
<dt> @ </dt><dd>在创建设备节点之后运行
</dd>
<dt> $ </dt><dd>在移除设备节点之前运行
</dd>
<dt> * </dt><dd>在创建设备节点之后，移除设备节点之前运行
</dd>
</dl>

<p>
hotplug将stdout、stderr和stdin连接到/dev/null，
因此在执行mdev的时候是看不到输出的。
</p>

<p>
配置举例：
</p>
<p class="verse">
- <a href="src/mdev/eg0-mdev.conf">boss mdev.conf</a>  <a href="https://github.com/slashbeast/mdev-like-a-boss">@github</a><br  />
- <a href="src/mdev/eg1-mdev.conf">snafu mdev.conf</a> <a href="http://www.snafu.priv.at/interests/debian/mdev.html">@snafu</a><br  />
- <a href="http://cross-lfs.org/view/clfs-embedded/arm/bootscripts/mdev.html">clfs mdev.conf</a><br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 固件</h3>
<div class="outline-text-3" id="text-1-5">
<p>
所有的firmware需要放到/lib/firmware，运行的时候，内核调用mdev，并传递文件名，
文件名是在源代码中直接指定的。
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 顺序插拔</h3>
<div class="outline-text-3" id="text-1-6">
<p>
内核并不会将热插拔事件顺序化，仅仅增加SEQNUM环境变量的值，
mdev可能会按照不同的顺序处理热插拔事件。
</p>

<p>
如果发现了/dev/mdev.seq那么就会和SEQNUM比较，有两秒钟的比较时间，
如果不相同，会按照通常方式运行，并写入SEQNUM + 1。
想要激活这个特性非常简单，执行如下命令。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #000000;">echo</span> &gt; /dev/mdev.seq
</pre>
</div>
<p>
就会会插入一个换行符，但是mdev足够聪明，它不会在这种情况下去等待两秒钟。
</p>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 热插拔配置</h3>
<div class="outline-text-3" id="text-1-7">
<p>
插拔自动挂载需要先写一个脚本，假定脚本为<a href="src/mdev/automounter.sh">/lib/mdev/automounter.sh</a>，
并且要确保文件有可执行权限，内容如下。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #228b22; font-style: italic;">#</span><span style="color: #228b22; font-style: italic;">!/bin/</span><span style="color: #0000ff; font-weight: bold;">sh</span>

<span style="color: #000000;">destdir</span>=/media

<span style="color: #8b008b; font-weight: bold;">do_umount</span>()
{
        <span style="color: #0000ff; font-weight: bold;">if</span> grep -qs <span style="color: #ff0000;">"^/dev/$1 "</span> /proc/mounts ; <span style="color: #0000ff; font-weight: bold;">then</span>
                umount <span style="color: #ff0000;">"${destdir}/$1"</span>;
        <span style="color: #0000ff; font-weight: bold;">fi</span>

        [ -d <span style="color: #ff0000;">"${destdir}/$1"</span> ] &amp;&amp; rmdir <span style="color: #ff0000;">"${destdir}/$1"</span>
}

<span style="color: #8b008b; font-weight: bold;">do_mount</span>()
{
        mkdir -p <span style="color: #ff0000;">"${destdir}/$1"</span> || <span style="color: #0000ff; font-weight: bold;">exit</span> 1

        <span style="color: #0000ff; font-weight: bold;">if</span> ! mount -t auto <span style="color: #ff0000;">"/dev/$1"</span> <span style="color: #ff0000;">"${destdir}/$1"</span>; <span style="color: #0000ff; font-weight: bold;">then</span>
                rmdir <span style="color: #ff0000;">"${destdir}/$1"</span>
                <span style="color: #0000ff; font-weight: bold;">exit</span> 1
        <span style="color: #0000ff; font-weight: bold;">fi</span>
}

<span style="color: #0000ff; font-weight: bold;">case</span> <span style="color: #ff0000;">"${ACTION}"</span><span style="color: #0000ff; font-weight: bold;"> in</span>
add|<span style="color: #ff0000;">""</span>)
        do_umount ${<span style="color: #000000;">MDEV</span>}
        do_mount ${<span style="color: #000000;">MDEV</span>}
        ;;
remove)
        do_umount ${<span style="color: #000000;">MDEV</span>}
        ;;
<span style="color: #0000ff; font-weight: bold;">esac</span>
</pre>
</div>

<p>
接着根据automounter.sh配置mdev.conf文件。
</p>
<div class="org-src-container">

<pre class="src src-sh">sd[a-z]           0:0     660
mmcblk[0-9]       0:0     660
sd[a-z][0-9]      0:0     660 */lib/mdev/automounter.sh
mmcblk[0-9]p[0-9] 0:0     660 */lib/mdev/automounter.sh
</pre>
</div>

<p>
此外还要修改一下/media目录文件系统类型，因为打算用它创建动态挂在点，
所以最好将它用tmpfs从Flash移动到RAM中。
可以通过上面提到的方法，写入到启动脚本，可以编辑/etc/fstab。
</p>
<div class="org-src-container">

<pre class="src src-sh">tmpfs         /media  tmpfs   defaults        0       0
</pre>
</div>

<p>
如果存在/dev/mdev.log文件，调试信息将自动添加到该文件。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 参考资料</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://git.busybox.net/busybox/tree/docs/mdev.txt">mdev官方文档</a>
</li>
<li><a href="http://git.busybox.net/busybox/tree/util-linux/mdev.c">mdev源代码</a>
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
